In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

from pydataset import data
from scipy import stats
from env import get_connection

---
<div class="alert alert-info">
1. Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.
</div>

In [2]:
db_url = get_connection('titanic_db')

query = '''
        SELECT * 
        FROM passengers
        '''

In [3]:
titanic_data = pd.read_sql(query, db_url)
titanic_data.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [4]:
def get_titanic_data():

    filename = 'titanic.csv'

    if os.path.isfile(filename):

        print('Found your sauce my bro')

        return pd.read_csv(filename)
        
    else:

        print('Searching for the sauce my guy')
        
        url = get_connection('titanic_db')

        query = '''
                SELECT * 
                FROM passengers
                '''
        
        titanic_df = pd.read_sql(query, url)
        titanic_df.to_csv(filename, index = 0)

        return titanic_df

In [5]:
get_titanic_data()

Found your sauce my bro

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,NaN,Southampton,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,NaN,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,NaN,Queenstown,1

---
<div class="alert alert-info">
2. Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.
</div>

In [6]:
db_url = get_connection('iris_db')

query = '''
        SELECT * 
        FROM species
        '''

In [7]:
iris_data = pd.read_sql(query, db_url)
iris_data.head()

   species_id species_name
0           1       setosa
1           2   versicolor
2           3    virginica

In [8]:
def get_iris_data():

    filename = 'iris.csv'

    if os.path.isfile(filename):

        print('Found your sauce my bro')

        return pd.read_csv(filename)
        
    else:

        print('Searching for the sauce my guy')
        
        url = get_connection('iris_db')

        query = '''
                SELECT * 
                FROM species
                '''
        
        iris_df = pd.read_sql(query, url)
        iris_df.to_csv(filename, index = 0)

        return iris_df

In [9]:
get_iris_data()

Found your sauce my bro

   species_id species_name
0           1       setosa
1           2   versicolor
2           3    virginica

---
<div class="alert alert-info">
3. Make a function named get_telco_data that returns the data from the telco_churn database in SQL. In your SQL, be sure to join contract_types, internet_service_types, payment_types tables with the customers table, so that the resulting dataframe contains all the contract, payment, and internet service options. Obtain your data from the Codeup Data Science Database.
</div>

In [10]:
db_url = get_connection('telco_churn')

query = '''
        SELECT internet_service_type_id, contract_type_id, payment_type_id
        FROM customers
        JOIN internet_service_types USING (internet_service_type_id)
        JOIN contract_types USING (contract_type_id)
        JOIN payment_types USING (payment_type_id)
        ;
        '''

In [11]:
telco_data = pd.read_sql(query, db_url)
telco_data.head()

   internet_service_type_id  contract_type_id  payment_type_id
0                         1                 2                2
1                         1                 1                2
2                         2                 1                1
3                         2                 1                1
4                         2                 1                2

In [12]:
def get_telco_data():

    filename = 'telco.csv'

    if os.path.isfile(filename):

        print('Found your sauce my bro')

        return pd.read_csv(filename)
        
    else:

        print('Searching for the sauce my guy')
        
        url = get_connection('telco_churn')

        query = '''
                SELECT internet_service_type_id, contract_type_id, payment_type_id
                FROM customers
                JOIN internet_service_types USING (internet_service_type_id)
                JOIN contract_types USING (contract_type_id)
                JOIN payment_types USING (payment_type_id)
                ;
                '''
        
        telco_df = pd.read_sql(query, url)
        telco_df.to_csv(filename, index = 0)
        
        return telco_df

In [13]:
get_telco_data()

Found your sauce my bro

      internet_service_type_id  contract_type_id  payment_type_id
0                            1                 2                2
1                            1                 1                2
2                            2                 1                1
3                            2                 1                1
4                            2                 1                2
...                        ...               ...              ...
7038                         1                 2                2
7039                         2                 1                1
7040                         1                 1                2
7041                         1                 3                2
7042                         1                 3                1

[7043 rows x 3 columns]

---
<div class="alert alert-info">
4. Once you've got your get_titanic_data, get_iris_data, and get_telco_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for the local filename of telco.csv, titanic.csv, or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.
</div>

In [14]:
titanic = get_titanic_data()
titanic.head()

Found your sauce my bro

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [15]:
iris = get_iris_data()
iris.head()

Found your sauce my bro

   species_id species_name
0           1       setosa
1           2   versicolor
2           3    virginica

In [16]:
telco = get_telco_data()
telco.head()

Found your sauce my bro

   internet_service_type_id  contract_type_id  payment_type_id
0                         1                 2                2
1                         1                 1                2
2                         2                 1                1
3                         2                 1                1
4                         2                 1                2